# Работа с БД SQLite

https://sqliteonline.com/

In [3]:
import sqlite3
from prettytable import from_db_cursor
from tempdir import tempdir

In [11]:
#db_name = tempdir("temp_SQLite.db")
db_name = ":memory"

In [8]:
db = sqlite3.connect(db_name)
cur = db.cursor()

In [9]:
cur.execute("CREATE TABLE cities (id integer PRIMARY KEY AUTOINCREMENT NOT NULL, name varchar2(100))")
db.commit()

In [10]:
cur.execute("SELECT * from cities")
from_db_cursor(cur)

+----+------+
| id | name |
+----+------+
+----+------+

In [12]:
cur.execute("PRAGMA table_info('cities')")
from_db_cursor(cur)

+-----+------+---------------+---------+------------+----+
| cid | name |      type     | notnull | dflt_value | pk |
+-----+------+---------------+---------+------------+----+
|  0  |  id  |    INTEGER    |    1    |    None    | 1  |
|  1  | name | varchar2(100) |    0    |    None    | 0  |
+-----+------+---------------+---------+------------+----+

In [13]:
cities = "Москва, Воронеж, Калуга".split(', ')
cities

['Москва', 'Воронеж', 'Калуга']

In [16]:
cities_data = [(city,) for city in cities]
cities_data

[('Москва',), ('Воронеж',), ('Калуга',)]

In [20]:
cur.executemany("INSERT INTO cities(name) VALUES(?)", [(city,) for city in cities])

In [21]:
cur.execute("SELECT * from cities")
from_db_cursor(cur)

+----+---------+
| id |   name  |
+----+---------+
| 1  |  Москва |
| 2  | Воронеж |
| 3  |  Калуга |
+----+---------+

In [22]:
cur.execute("SELECT * from cities")
print(*cur)

(1, 'Москва') (2, 'Воронеж') (3, 'Калуга')

In [24]:
sql_insert = "INSERT INTO cities(name) VALUES (?)"
cur.execute(sql_insert, ("Тула",))

cur.execute("SELECT * from cities")
from_db_cursor(cur)

+----+---------+
| id |   name  |
+----+---------+
| 1  |  Москва |
| 2  | Воронеж |
| 3  |  Калуга |
| 4  |   Тула  |
+----+---------+

In [26]:
sql_delete = "DELETE FROM cities WHERE id = ?"
cur.execute(sql_delete, [1])

cur.execute("SELECT * from cities")
from_db_cursor(cur)

+----+---------+
| id |   name  |
+----+---------+
| 2  | Воронеж |
| 3  |  Калуга |
| 4  |   Тула  |
+----+---------+

In [29]:
sql_update = """
UPDATE cities
set name = 'г. '|| name
WHERE id = 2
    AND name NOT LIKE 'г.%'
"""
 
cur.execute(sql_update)

cur.execute("SELECT * from cities")
from_db_cursor(cur)

+----+---------------+
| id |      name     |
+----+---------------+
| 2  | г. r. Воронеж |
| 3  |     Калуга    |
| 4  |      Тула     |
+----+---------------+

In [31]:
cur.execute("SELECT * from cities")
t = cur.fetchall()

print(t)
print(type(t))
print(t[0:3])

[(2, 'г. r. Воронеж'), (3, 'Калуга'), (4, 'Тула')]
<class 'list'>
[(2, 'г. r. Воронеж'), (3, 'Калуга'), (4, 'Тула')]